# Use `brew bundle` to install the packages listed below

cask_args appdir: "/Applications"

# Make everything clean
update
doctor

# Packages
brew "compose"
brew "cowsay"
brew "htop"
brew "git"
brew "node"
brew "openssl"
brew "php"
brew "pipenv"
brew "python3"
brew "vim", args: ["with-override-system-vi"]
brew "wget"
brew "yarn"
brew "zsh"

# Cask
brew "cask"

# Apps
cask "calibre"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "firefox"
cask "grammarly"
cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "logitech-options"
cask "marshallofsound-goo"
cask "pgadmin4"
cask "postman"
cask "visual-studio-code"
cask "wavebox"
cask "windscribe"

# Mas
brew "mas"

# App Store Apps
mas "Magnet", id: 441258766
mas "Pushbullet", id: 948415170
mas "Soulver", id: 413965349
mas "The Unarchiver", id: 425424353
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
mas "Kindle", id: 405399194
